package l18Eigthteen_Collection_2.practice;

//practice
    /*
    Завдання №1: Створіть HashMap, яка зберігає імена студентів та їх оцінки за екзамен. Додайте декілька записів в цю мапу і виведіть її на екран.

    Завдання №2: Використовуючи мапу з попереднього завдання, напишіть метод, який приймає ім'я студента як вхідний параметр і видаляє його з мапи.

    Завдання №3: Створіть LinkedHashMap з рядками як ключами та значеннями. Додайте декілька записів і виведіть мапу,
     щоб показати, що вона зберігає порядок вставки.

    Завдання №4: Створіть TreeMap з рядками як ключами та значеннями. Додайте декілька записів і виведіть мапу, щоб показати,
     що вона автоматично сортує записи за ключами.

    Завдання №5: Напишіть програму, яка підраховує кількість входжень кожного слова в тексті. Використайте HashMap, де ключі - це слова,
    а значення - кількість їх входжень.

    Завдання №6: Напишіть метод, який перевіряє, чи дві мапи є ідентичними. Метод повинен приймати дві мапи як вхідні параметри і повертати true,
     якщо вони ідентичні, і false в іншому випадку.

    Завдання №7: Напишіть програму, яка перевертає мапу. Вхідна мапа повинна мати рядки як ключі та цілі числа як значення.
    Вихідна мапа повинна мати цілі числа як ключі та множини рядків як значення.
    // input ("a"=1, "b" = 2 , "c" = 3, "d"=3)  -> {1=[a], 2=[b], 3-[c,d]}
    Map<String,Integer> firstInputMap = new HashMap();
    Map<Integer, HashSet<String>> outPutMap = new HashMap();
     */
public class practice {
}
