package l31PracticeThread;

public class Lecture31 {


    public static void main(String[] args) {
        /*
        1 ExecutorService / Semaphore
        Припустимо, у нас є басейн із обмеженою кількістю ліжок (наприклад, 3), і клієнти приходять, щоб взяти ліжка для відпочинку.
        Ми хочемо забезпечити, щоб одночасно було доступно обмежене число ліжок, а інші клієнти повинні чекати, поки ліжка звільняться.
         */

        /*
        2 Lock / Condition
        Припустимо, у нас є банкомат, який може обслуговувати лише одного клієнта одночасно.
        Клієнти приходять, щоб взяти гроші з банкомату. Ми хочемо забезпечити,
        щоб банкомат обслуговував тільки одного клієнта, поки він не закінчить операцію.
         */

        /*
        3 CountDownLatch / ThreadLocal
        у нас є багатопоточний додаток, який обробляє певну кількість завдань,
        і ми хочемо виміряти час, який кожен потік витратив на обробку своєї частини завдань.
         */

        /*
        4
        у нас є додаток, в якому декілька потоків збільшують значення цілочисельної змінної на певну кількість разів.
         Ми хочемо підрахувати загальну суму збільшень змінної за всі потоки.
         */

    }


}
