public class Main {
    public static void main(String[] args)
    {
        System.out.println(" Я починаю курс Java в robot_dreams і вже вмію використовувати Git");
        System.out.println("Hello world! Happy new year!");
    }

   /*
сім привіт, нотатка по вашим ДЗ, ви усі молодці ми вже дійшли до моменту - що скажімо так "програми не ломаются / все працює",  тому поговоримо більш за "зовнішній вигляд"
Помічаю у багатьох те саме, тому винесу просто сюди (це більш вже про звичку називати / писати правильно) - а не про те щоб працювало
Так як ми вже дійшли до колекцій, то
1 Якщо ви створюєте клас (їх ще називають entity class, POJO - про це буде більш детально коли будемо з базами даних працювати)
клас який описує якусь сутність (з багатьох дз) - приклад студент, тобто клас у якого просто є приватні поля і гетери з сетерами
завжди перевизначайте там іквелс / хешкод / ту стрінг
завжди поля мають бути приватними, завжди мають бути гетери / сетери
2 назви класів - завжди кемел кейс, без _ - / і тд
3 назви пакетів - це завжди одне слово (з маленької літери), якщо слово велике - воно створюється через точку (що буде 2 пакети вже) і також без _ / - і тд
4 назви змінних / полів / класів - має нести значення, щоб я подивився на назву поля / класу / методу і розумів що він робить і нащо треба
5 якщо ви створюєте якийсь обєкт (арайЛіст / хешСет / будь-який свій обект) і не використовуєте методи конкретної імплементації (типу як у лінкід ліста findFirst) - завжди прирівнюйте це до більш абстрактного інтерфейсу / класу, я то і раніше повторював, просто старайтесь того дотримуватись;
на даний момент, це все, але трошки пізніше ми познайомимось і з іншими моментами; Просто цей коментар я залишаю багато де, трошки вже цей - копіпастити не хочу.
Дотримуйтесь цих 5х пунктів і візьміть собі їх за звичку, до них з часом додадуться ще) (edited)

*/
    }


